<?php

use Illuminate\Database\Seeder;
use App\Cechelon;

class CEchelonTableSeeder extends Seeder
{
    private $echelons = [
    	'01' => 'ประเภททั่วไป ระดับปฏิบัติงาน',
    	'02' => 'ประเภททั่วไป ระดับชำนาญงาน',
    	'03' => 'ประเภททั่วไป ระดับอาวุโส',
    	'04' => 'ประเภททั่วไป ระดับทักษะพิเศษ',
    	'05' => 'ประเภทวิชาการ ระดับปฏิบัติการ',
    	'06' => 'ประเภทวิชาการ ระดับชำนาญการ',
    	'07' => 'ประเภทวิชาการ ระดับชำนาญการพิเศษ',
    	'08' => 'ประเภทวิชาการ ระดับเชี่ยวชาญ',
    	'09' => 'ประเภทวิชาการ ระดับทรงคุณวุฒิ',
    	'10' => 'ประเภทอำนวยการ ระดับต้น',
    	'11' => 'ประเภทอำนวยการ ระดับสูง',
    	'12' => 'ประเภทบริหาร ระดับต้น',
    	'13' => 'ประเภทบริหาร ระดับสูง',
    ];

    public function run()
    {
        DB::table('cechelons')->delete();
        foreach ($this->echelons as $key => $value) {
            Cechelon::create(['echelon_id' => $key, 'echelon_name' => $value]);
        }
    }
}
